vlm/extension/Documents/ЭтапПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЭтапПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АльтернативныеВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыРабочихЦентров</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ЭтапПроизводства2_2/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура бит_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("РеквизитыШапки") Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.РеквизитыШапки);
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("ДанныеСпецификации")
			И ДанныеЗаполнения.Свойство("ДанныеЭтапа") Тогда

			ЗаполнитьПоСпецификации(ДанныеЗаполнения.ДанныеСпецификации, ДанныеЗаполнения.ДанныеЭтапа);

		Иначе

			Если ДанныеЗаполнения.Свойство("ВыходныеИзделия") Тогда
				ВыходныеИзделия.Загрузить(ДанныеЗаполнения.ВыходныеИзделия);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ПобочныеИзделия") Тогда
				ПобочныеИзделия.Загрузить(ДанныеЗаполнения.ПобочныеИзделия);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ВыходныеИзделия")
				Или ДанныеЗаполнения.Свойство("ПобочныеИзделия") Тогда
				ЗаполнитьДатуПроизводстваИзделийВШапке();
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ОбеспечениеМатериаламиИРаботами") Тогда
				ОбеспечениеМатериаламиИРаботами.Загрузить(ДанныеЗаполнения.ОбеспечениеМатериаламиИРаботами);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("Трудозатраты") Тогда
				Трудозатраты.Загрузить(ДанныеЗаполнения.Трудозатраты);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ВидыРабочихЦентров") Тогда
				ВидыРабочихЦентров.Загрузить(ДанныеЗаполнения.ВидыРабочихЦентров);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("АльтернативныеВидыРабочихЦентров") Тогда
				АльтернативныеВидыРабочихЦентров.Загрузить(ДанныеЗаполнения.АльтернативныеВидыРабочихЦентров);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("Последователи")
				И ТипЗнч(ДанныеЗаполнения.Последователи) = Тип("Массив") Тогда
				Последователи.Очистить();
				Для каждого Последователь Из ДанныеЗаполнения.Последователи Цикл
					НоваяСтрока = Последователи.Добавить();
					НоваяСтрока.Этап     = Последователь;
					НоваяСтрока.ТипСвязи = Документы.ЭтапПроизводства2_2.ТипСвязиПоследователь();
				КонецЦикла;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("НаборыМатериаловИРабот") Тогда
				НаборыМатериаловИРабот.Загрузить(ДанныеЗаполнения.НаборыМатериаловИРабот);
				УправлениеДаннымиОбИзделиях.ОбновитьТаблицуНаборыМатериаловИРабот(ЭтотОбъект);
			КонецЕсли;

			Если ЭтоНовый() Тогда
				ОбщегоНазначенияУТ.ОчиститьИдентификаторыДокумента(ЭтотОбъект, "ВыходныеИзделия,ПобочныеИзделия,ОбеспечениеМатериаламиИРаботами");
				СтруктураЗаказаПроведениеДокументов.ОчиститьКлючиСтрокВТабличнойЧасти(ЭтотОбъект, "ОбеспечениеМатериаламиИРаботами", "КлючНоменклатура");
				СтруктураЗаказаПроведениеДокументов.ОчиститьКлючиСтрокВТабличнойЧасти(ЭтотОбъект, "Трудозатраты", "КлючВидРабот");
			КонецЕсли;

		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("ВыходныеИзделияСерии") Тогда
			ВыходныеИзделияСерии.Загрузить(ДанныеЗаполнения.ВыходныеИзделияСерии);
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ПобочныеИзделияСерии") Тогда
			ПобочныеИзделияСерии.Загрузить(ДанныеЗаполнения.ПобочныеИзделияСерии);
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("РасходМатериаловИРабот") Тогда
			РасходМатериаловИРабот.Загрузить(ДанныеЗаполнения.РасходМатериаловИРабот);
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ЭкономияМатериалов") Тогда
			ЭкономияМатериалов.Загрузить(ДанныеЗаполнения.ЭкономияМатериалов);
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ЭкономияМатериаловСерии") Тогда
			ЭкономияМатериаловСерии.Загрузить(ДанныеЗаполнения.ЭкономияМатериаловСерии);
		КонецЕсли;

		ПараметрыУказанияСерий = Документы.ЭтапПроизводства2_2.ПараметрыУказанияСерий(ЭтотОбъект);
		ЗаполнитьСтатусыУказанияСерийВТЧ("ВыходныеИзделия", ПараметрыУказанияСерий);
		ЗаполнитьСтатусыУказанияСерийВТЧ("ПобочныеИзделия", ПараметрыУказанияСерий);
		ЗаполнитьСтатусыУказанияСерийВТЧ("ОбеспечениеМатериаламиИРаботами", ПараметрыУказанияСерий);
		ЗаполнитьСтатусыУказанияСерийВТЧ("РасходМатериаловИРабот", ПараметрыУказанияСерий);
		ЗаполнитьСтатусыУказанияСерийВТЧ("ЭкономияМатериалов", ПараметрыУказанияСерий);
		#Вставка     
		// {{ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [03.05.2026 16:13:36] +        
		Если ДанныеЗаполнения.Свойство("бит_ВРЦ") Тогда                                          
			//ВидыРабочихЦентров 
			Для каждого стр из ВидыРабочихЦентров Цикл
				Если стр.ВидРабочегоЦентра = ДанныеЗаполнения.бит_ВРЦ Тогда
					стр.Использовать = Истина;
				Иначе
					стр.Использовать = Ложь;
				КонецЕсли;
			КонецЦикла;  
			//АльтернативныеВидыРабочихЦентров
			Для каждого стр из АльтернативныеВидыРабочихЦентров Цикл
				Если стр.ВидРабочегоЦентра = ДанныеЗаполнения.бит_ВРЦ Тогда
					стр.Использовать = Истина;
				Иначе
					стр.Использовать = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// }}ПервыйБИТ ЛистТребований [ЛТ5.36]  [VUVaynula@1cbit.ru] [03.05.2026 16:13:36] -
		#КонецВставки

	КонецЕсли;

	ЗаполнитьНомерПоРаспоряжению();

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный  = Пользователи.ТекущийПользователь();
	КонецЕсли;

	ВидЦены = Справочники.ВидыЦен.ВидЦеныПлановойСтоимостиТМЦ(ВидЦены);
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Справочники.ВидыЦен.ПолучитьРеквизитыВидаЦены(ВидЦены).ВалютаЦены);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ВариантПриемкиТоваров) Тогда
		ВариантПриемкиТоваров = ЗакупкиСервер.ПолучитьВариантПриемкиТоваров();
	КонецЕсли;

	Если Не ВыполняетсяПакетноеФормирование() Тогда

		ОбеспечениеПроизводства.ЗаполнитьНазначениеПолуфабрикатовВЭтапеПроизводства(ЭтотОбъект);

		ПараметрыЗаполнения = Документы.ЭтапПроизводства2_2.ПараметрыЗаполненияВидаДеятельностиНДС(ЭтотОбъект);
		УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ВыпускПодДеятельность, ПараметрыЗаполнения);

		ПараметрыВыбораСтатейИАналитик = Документы.ЭтапПроизводства2_2.ПараметрыВыбораСтатейИАналитик(ЭтотОбъект);
		ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);

	КонецЕсли;

	ЭтапПроизводства2_2Локализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);

КонецПроцедуры
